{
  "basics": {
    "name": "Attila Szeremi",
    "label": "Web Programmer (backend and frontend)",
    "picture": "/img/attila-szeremi.jpg",
    "email": "a@szeremi.org",
    "phone": "",
    "website": "http://www.szeremi.org",
    "summary": "My name is Attila Szeremi and am a professional in both backend and frontend programming for the web. I started learning programming in 2007 with the help of a paid PHP course and that brought me to turn my own static HTML Dreamweaver websites dynamic. I got my first PHP job in 2009 during the summer of my education, and moved to work in London near the end of 2012.\n\nThroughout my career I've been very passionate about programming; there doesn't seem to be any end to the ways I find to improve myself, being able to keep myself up-to-date with the latest web technologies and practices. Although I've had more backend experience than frontend, I am nearly as good in frontend and I'm especially keen on doing that too.",
    "profiles": [
      {
        "network": "GitHub",
        "username": "amcsi",
        "url": "https://github.com/amcsi"
      },
      {
        "network": "LinkedIn",
        "username": "Attila Szeremi",
        "url": "https://www.linkedin.com/in/attila-szeremi-2733b525"
      },
      {
        "network": "Facebook",
        "username": "amcsi",
        "url": "https://facebook.com/amcsi"
      },
      {
        "network": "Twitter",
        "username": "amcsi_san",
        "url": "https://twitter.com/amcsi_san"
      }
    ]
  },
  "work": [
    {
      "company": "LifeWorks",
      "position": "Backend PHP developer",
      "website": "http://workangel.com/",
      "releaseDate": "2015-01",
      "endDate": "",
      "summary": "LifeWorks (formally known as WorkAngel) located in London is a company producing a platform for a benefit system and achieving workplace social engagement in a fun way with the help of gaining achievements and badges. This has been where I have been gaining the most knowledge, being surrounded by very talented and inspirational fellow programmer colleagues, and being exposed to many different points of view for problem solving.",
      "highlights": [
        "Develop with PHP the backend side of the JSON REST API which is used by the Web frontend, Android and iOS",
        "Use ReactJS and jQuery to enrich the frontend our administration platform which is a separate project using the same API.",
        "Migrate administration project's JavaScript tooling from Gulp and Bower to NPM and Webpack.",
        "Write unit and end-to-end tests to ensure future extensibility of the platform",
        "Receive and write code reviews"
      ]
    },
    {
      "company": "NetEfficiency",
      "position": "PHP and JavaScript developer",
      "website": "http://netefficiency.co.uk/",
      "releaseDate": "2012-11",
      "endDate": "2014-11",
      "summary": "NetEfficiency Ltd. is a web development agency and was the first company in London I was working for. Here I was responsible for development of various websites, among which was Smallcharities and various worldwide versions of Autoglass.",
      "highlights": [
        "Use both PHP and JavaScript to create full interactive booking processes for car windscreen repair",
        "Migrate a legacy PHP project from ZF1 to using ZF2",
        "Rewrite from scratch a booking management tool such that it be completely decoupled from the fixed booking process, making it extensible and its decoupled API usable by many projects",
        "Migrate an old booking administration system to using Bootstrap and AngularJS",
        "Help all colleagues move from the legacy SVN VCS to using Git"
      ]
    },
    {
      "company": "Stylers Ltd.",
      "position": "PHP and JavaScript developer",
      "website": "http://stylers.hu/",
      "releaseDate": "2011-04",
      "endDate": "2012-10",
      "summary": "Stylers is a web development agency located in Budapest, Hungary. Here I was developing from scratch many different kinds of websites including promotional Facebook web apps.",
      "highlights": [
        "Develop in PHP and JavaScript many smaller website projects using an in-house CMS and deliver under tight deadlines",
        "Work with Facebook's OAuth and other social networks' APIs to create Facebook apps and integrate with our platform",
        "Refactor parts of the CMS to vastly reduce the steps needed to start on a new project",
        "Maintain high knowledge of each browser's quirks, especially IE7"
      ]
    },
    {
      "company": "PPT Group Ltd.",
      "position": "ExtJS developer",
      "website": "http://ppt.eu/",
      "releaseDate": "2010-09",
      "endDate": "2011-04",
      "summary": "PPT Group is a web development company in Budapest that also had in-house project. I was responsible for their biggest in-house project.",
      "highlights": [
        "Get up to a professional level of JavaScript in half a year from having very little knowledge",
        "Develop a UI-rich social network platform using ExtJS 3",
        "Dive deep in the depths of the source code of the framework for purposes of debugging"
      ]
    }
  ],
  "publications": [
    {
      "name": "My own website",
      "website": "http://www.szeremi.org/",
      "summary": "My open-source personal and professional website created with NodeJS and ReactJS. The project is hosted on Digital Ocean and I'm using Docker containers to host each application."
    },
    {
      "name": "Livecoding.tv coding sessions",
      "website": "https://www.livecoding.tv/amcsi/",
      "summary": "I livestream as I code my personal open-source projects for entertaining viewers, hoping to give them good ideas to learn and also potentially receive help myself."
    }
  ],
  "skills": [
    {
      "name": "Web Programming",
      "level": "Master",
      "keywords": ["PHP", "JavaScript", "CSS", "Rest APIs"]
    },
    {
      "name": "PHP frameworks",
      "level": "Master",
      "keywords": ["Zend Framework 2", "Laravel 5"]
    },
    {
      "name": "JavaScript technologies",
      "level": "Advanced",
      "keywords": ["ReactJS", "Redux", "Webpack", "Isomorphic apps", "AngularJS 1", "NodeJS", "ExtJS"]
    },
    {
      "name": "Databases",
      "level": "Advanced",
      "keywords": ["MySQL", "MongoDB"]
    },
    {
      "name": "System administration",
      "level": "Intermediate",
      "keywords": ["Linux", "Digital Ocean", "Docker", "vim"]
    },
    {
      "name": "Other web technologies",
      "level": "Advanced",
      "keywords": ["Security", "Git", "Testing"]
    }
  ],
  "languages": [
    {
      "language": "Hungarian",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Spanish",
      "fluency": "Limited professional proficiency"
    }
  ],
  "interests": [
    {
      "name": "Spanish language"
    },
    {
      "name": "Hispanic culture"
    },
    {
      "name": "Travel"
    },
    {
      "name": "Programming"
    },
    {
      "name": "Anime"
    }
  ]
}
